fairway-api/app/controllers/api/v1/auth_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'test@example.com' LIMIT 1
---
  def login
    return unless validate_required_params(params, [:email, :password])

    email = sanitize_email(params[:email])
    password = params[:password]

    return render_error("Invalid email format", :bad_request) unless email
    return render_error("Password too short", :bad_request) if password.length < 8

    user = User.find_by(email: email)

INSERT INTO "users" ("email", "first_name", "last_name", "password_digest", "handicap_index", "verified_handicap", "phone", "date_of_birth", "preferred_tees", "email_verified", "email_verified_at", "rounds_played", "verified_rounds", "created_at", "updated_at") VALUES ('test@example.com', 'John', 'Doe', '$2a$12$kClXCP.U9jqhsseUfwtdM.fOY/jNEsg6tOt3S1bftvYwm2V8tfGyS', NULL, NULL, NULL, NULL, NULL, FALSE, NULL, 0, 0, '2025-09-24 14:40:56.610398', '2025-09-24 14:40:56.610398') RETURNING "id"
---
  def register
    return unless validate_required_params(params, [:email, :password, :first_name, :last_name])

    # Sanitize inputs
    sanitized_params = {
      email: sanitize_email(params[:email]),
      password: params[:password],
      first_name: sanitize_string(params[:first_name]),
      last_name: sanitize_string(params[:last_name]),
      phone: sanitize_string(params[:phone])
    }

    # Validate sanitized inputs
    return render_error("Invalid email format", :bad_request) unless sanitized_params[:email]
    return render_error("Password must be at least 8 characters", :bad_request) if sanitized_params[:password].length < 8
    return render_error("First name is required", :bad_request) if sanitized_params[:first_name].blank?
    return render_error("Last name is required", :bad_request) if sanitized_params[:last_name].blank?

    user = User.new(sanitized_params)

    if user.save