fairway-api/app/controllers/api/v1/courses_controller.rb

  def index
    courses = Course.active.includes(:holes)

    # Filter by location if provided
    if params[:latitude] && params[:longitude]
      radius_km = params[:radius] || 50
      courses = courses.near(params[:latitude].to_f, params[:longitude].to_f, radius_km.to_f)
    end

    # Search by name if provided
    if params[:search].present?
      courses = courses.where("name ILIKE ?", "%#{params[:search]}%")
    end

    courses = courses.limit(50).order(:name)

    render_success({
      courses: courses.map { |course| course_response(course) }
---
SELECT "holes".* FROM "holes" WHERE "holes"."course_id" IN ('ae402f19-4ec4-46a4-a83f-2250fea3982f', '443a37b0-9cfc-4e2b-8565-c77212260f99', 'a5924311-0093-4b58-85aa-d2b6126d1024')
SELECT "courses".* FROM "courses" WHERE "courses"."active" = TRUE ORDER BY "courses"."name" ASC LIMIT 50

  def nearby
    return render_error("Latitude and longitude required") unless params[:latitude] && params[:longitude]

    latitude = params[:latitude].to_f
    longitude = params[:longitude].to_f
    radius_km = (params[:radius] || 25).to_f

    courses = Course.active
                   .near(latitude, longitude, radius_km)
                   .includes(:holes)
                   .limit(20)

    courses_with_distance = courses.map do |course|
---
SELECT "courses".* FROM "courses" WHERE "courses"."active" = TRUE AND (6371 * acos(cos(radians(36.5674)) * cos(radians(latitude)) * cos(radians(longitude) - radians(-121.9508)) + sin(radians(36.5674)) * sin(radians(latitude))) < 50.0) LIMIT 20
SELECT "holes".* FROM "holes" WHERE "holes"."course_id" = '443a37b0-9cfc-4e2b-8565-c77212260f99'

  def holes
    holes = @course.holes.by_number

    render_success({
      course: course_response(@course),
      holes: holes.map { |hole| hole_response(hole) }
    })
---
SELECT "holes".* FROM "holes" WHERE "holes"."course_id" = '443a37b0-9cfc-4e2b-8565-c77212260f99' ORDER BY "holes"."number" ASC

  def set_course
    @course = Course.active.find(params[:id])
---
SELECT "courses".* FROM "courses" WHERE "courses"."active" = TRUE AND "courses"."id" = '443a37b0-9cfc-4e2b-8565-c77212260f99' LIMIT 1

  def detailed_course_response(course)
    base_response = course_response(course)
    base_response.merge({
      holes: course.holes.by_number.map { |hole| hole_response(hole) },
      recent_rounds_count: course.rounds.completed.where('started_at > ?', 30.days.ago).count,
      average_score: course.average_score
---
SELECT "holes".* FROM "holes" WHERE "holes"."course_id" = '443a37b0-9cfc-4e2b-8565-c77212260f99' ORDER BY "holes"."number" ASC