fairway-api/app/controllers/api/v1/rounds_controller.rb

SELECT "courses".* FROM "courses" WHERE "courses"."id" IN ('ae402f19-4ec4-46a4-a83f-2250fea3982f', '443a37b0-9cfc-4e2b-8565-c77212260f99', 'a5924311-0093-4b58-85aa-d2b6126d1024')
SELECT "hole_scores".* FROM "hole_scores" WHERE "hole_scores"."round_id" IN ('9e2e03d7-4354-45a8-85e4-e4fbaeb64837', 'cd1e74ad-136e-430f-8be6-f39cea915407', '2ce35f3f-3c05-462c-ad23-4e2439a55a17')
SELECT "holes".* FROM "holes" WHERE "holes"."course_id" IN ('ae402f19-4ec4-46a4-a83f-2250fea3982f', '443a37b0-9cfc-4e2b-8565-c77212260f99', 'a5924311-0093-4b58-85aa-d2b6126d1024')
SELECT "round_attestations".* FROM "round_attestations" WHERE "round_attestations"."round_id" IN ('9e2e03d7-4354-45a8-85e4-e4fbaeb64837', 'cd1e74ad-136e-430f-8be6-f39cea915407', '2ce35f3f-3c05-462c-ad23-4e2439a55a17')
SELECT COUNT(*) FROM "hole_scores" WHERE "hole_scores"."round_id" = 'db9db4e8-4512-485a-9066-cd98728c6006'
SELECT COUNT(*) FROM "holes" WHERE "holes"."course_id" = 'ae402f19-4ec4-46a4-a83f-2250fea3982f'
SELECT "hole_scores".* FROM "hole_scores" WHERE "hole_scores"."round_id" = 'db9db4e8-4512-485a-9066-cd98728c6006'
---
  def index
    # Fix N+1 query by including all necessary associations
    rounds = current_user.rounds.includes(:course, :hole_scores, :round_attestations, course: :holes).recent

    # Filter by status if provided
    case params[:status]
    when 'completed'
      rounds = rounds.completed
    when 'in_progress'
      rounds = rounds.in_progress
    when 'verified'
      rounds = rounds.verified
    end

    # Pagination support
    limit = [params[:limit]&.to_i || 10, 50].min
    offset = [params[:offset]&.to_i || 0, 0].max

    # Get total count before pagination
    total_count = rounds.count

    # Apply pagination
    rounds = rounds.limit(limit).offset(offset)

SELECT "courses".* FROM "courses" WHERE "courses"."id" = 'ae402f19-4ec4-46a4-a83f-2250fea3982f' LIMIT 1
INSERT INTO "rounds" ("user_id", "course_id", "started_at", "completed_at", "submitted_at", "tee_color", "course_rating", "slope_rating", "total_strokes", "total_putts", "score_differential", "weather_conditions", "temperature", "wind_speed", "wind_direction", "is_verified", "is_provisional", "verification_count", "fraud_risk_score", "fraud_risk_factors", "location_verified", "start_latitude", "start_longitude", "fairways_hit", "greens_in_regulation", "total_penalties", "created_at", "updated_at") VALUES ('785c65eb-f711-4691-be87-d7ed25d93556', 'a7850e90-7796-4668-9baf-f91f793901b4', '2025-09-25 23:41:31.229318', NULL, NULL, 'white', 67.2, 113, NULL, NULL, NULL, NULL, NULL, NULL, NULL, FALSE, TRUE, 0, 0.0, NULL, FALSE, NULL, NULL, 0, 0, 0, '2025-09-25 23:41:31.239997', '2025-09-25 23:41:31.239997') RETURNING "id"
---
  def create
    # Verify user is at course location
    course = Course.find(round_params[:course_id])

    if round_params[:start_latitude] && round_params[:start_longitude]
      unless course.within_geofence?(round_params[:start_latitude].to_f, round_params[:start_longitude].to_f)
        return render_error("You must be at the course to start a round", :forbidden)
      end
    end

    round = current_user.rounds.build(round_params)
    round.started_at = Time.current
    round.course_rating = course.course_rating
    round.slope_rating = course.slope_rating

    if round.save

UPDATE "rounds" SET "completed_at" = '2025-09-24 15:07:13.548000', "submitted_at" = '2025-09-24 15:07:13.548000', "total_strokes" = 72, "total_putts" = 32, "score_differential" = -2.2, "fairways_hit" = 12, "greens_in_regulation" = 12, "updated_at" = '2025-09-24 15:07:13.717402' WHERE "rounds"."id" = 'db9db4e8-4512-485a-9066-cd98728c6006'
---
  def update
    return render_error("Round already completed") if @round.completed?

    if @round.update(round_update_params)

SELECT "courses".* FROM "courses" WHERE "courses"."id" IN ('ae402f19-4ec4-46a4-a83f-2250fea3982f', '443a37b0-9cfc-4e2b-8565-c77212260f99', 'a5924311-0093-4b58-85aa-d2b6126d1024')
SELECT "hole_scores".* FROM "hole_scores" WHERE "hole_scores"."round_id" IN ('9e2e03d7-4354-45a8-85e4-e4fbaeb64837', 'cd1e74ad-136e-430f-8be6-f39cea915407', '2ce35f3f-3c05-462c-ad23-4e2439a55a17')
SELECT COUNT(*) FROM "hole_scores" WHERE "hole_scores"."round_id" = 'db9db4e8-4512-485a-9066-cd98728c6006'
---
  def statistics
    # Preload all associations needed for statistics
    rounds = current_user.rounds.completed.includes(:hole_scores, :course, :round_attestations)

    # Use UserStatsService to calculate comprehensive statistics
    user_stats_service = UserStatsService.new(current_user)
    comprehensive_stats = user_stats_service.generate_comprehensive_stats

    stats = {
      total_rounds: rounds.count,
      verified_rounds: rounds.verified.count,
      average_score: current_user.average_score,
      lowest_score: rounds.minimum(:total_strokes),
      handicap_index: current_user.handicap_index&.to_f,
      verified_handicap: current_user.verified_handicap&.to_f,
      recent_trend: calculate_recent_trend(rounds.limit(10)),


SELECT "holes".* FROM "holes" WHERE "holes"."course_id" = 'ae402f19-4ec4-46a4-a83f-2250fea3982f'
SELECT "rounds".* FROM "rounds" WHERE "rounds"."user_id" = '85bd80db-89ca-4477-925b-502853af17e9' AND "rounds"."id" = 'db9db4e8-4512-485a-9066-cd98728c6006' LIMIT 1
SELECT "courses".* FROM "courses" WHERE "courses"."id" = 'ae402f19-4ec4-46a4-a83f-2250fea3982f' LIMIT 1
---
  def set_round
    # Preload associations to avoid N+1 queries
    @round = current_user.rounds.includes(:course, hole_scores: :hole).find(params[:id])