fairway-api/app/controllers/api/v1/rounds_controller.rb

  def create
    # Verify user is at course location
    course = Course.find(round_params[:course_id])
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = 'ae402f19-4ec4-46a4-a83f-2250fea3982f'

  def set_round
    @round = current_user.rounds.find(params[:id])
---
SELECT "rounds".* FROM "rounds" WHERE "rounds"."user_id" = '85bd80db-89ca-4477-925b-502853af17e9' AND "rounds"."id" = 'db9db4e8-4512-485a-9066-cd98728c6006' LIMIT 1