fairway-api/app/models/course.rb

  def create_default_holes
    return if holes.any?

    # Create 18 default holes with basic par structure
    hole_pars = [4, 4, 3, 4, 5, 4, 3, 4, 4, 4, 4, 3, 5, 4, 3, 4, 4, 5]

    hole_pars.each_with_index do |par, index|
      holes.create!(
        number: index + 1,
        par: par,
        handicap: index + 1,
        yardage_white: par == 3 ? 150 : (par == 4 ? 350 : 500)
      )
---
INSERT INTO "holes" ("course_id", "number", "par", "handicap", "yardage_black", "yardage_blue", "yardage_white", "yardage_red", "yardage_gold", "tee_latitude", "tee_longitude", "green_latitude", "green_longitude", "description", "shape", "created_at", "updated_at", "distance") VALUES ('5868b818-ba67-4890-ab10-d5bf08f96b91', 1, 4, 1, NULL, NULL, 350, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2025-09-24 18:30:32.398773', '2025-09-24 18:30:32.398773', 350) RETURNING "id"