fairway-api/app/models/hole_score.rb

  def update_round_totals
    # Trigger round recalculation
    round.save! if round.persisted?
---
UPDATE "rounds" SET "total_strokes" = 28, "total_putts" = 11, "score_differential" = -37.0, "fairways_hit" = 3, "greens_in_regulation" = 1, "total_penalties" = 3, "updated_at" = '2025-09-24 16:39:47.894599' WHERE "rounds"."id" = '05073afa-8a30-464c-9b99-028742a05ec1'