fairway-api/app/models/round.rb

  def completion_percentage
    return 0 if course.holes.empty?
    (holes_completed.to_f / course.holes.count * 100).round(1)
---
SELECT 1 AS one FROM "holes" WHERE "holes"."course_id" = 'ae402f19-4ec4-46a4-a83f-2250fea3982f' LIMIT 1
SELECT COUNT(*) FROM "holes" WHERE "holes"."course_id" = 'ae402f19-4ec4-46a4-a83f-2250fea3982f'

  def maximum_hole_scores
    return total_strokes unless course.holes.any?

    course.holes.sum do |hole|
---
SELECT 1 AS one FROM "holes" WHERE "holes"."course_id" = 'ae402f19-4ec4-46a4-a83f-2250fea3982f' LIMIT 1
SELECT "holes".* FROM "holes" WHERE "holes"."course_id" = 'ae402f19-4ec4-46a4-a83f-2250fea3982f'

  def update_user_stats
    if saved_change_to_completed_at? && completed?
      user.increment!(:rounds_played)
      user.increment!(:verified_rounds) if is_verified
---
UPDATE "users" SET "rounds_played" = COALESCE("rounds_played", 0) + 1 WHERE "users"."id" = '85bd80db-89ca-4477-925b-502853af17e9'
UPDATE "users" SET "verified_rounds" = COALESCE("verified_rounds", 0) + 1 WHERE "users"."id" = '8d635edf-31a5-49aa-9e1d-1e596ba37a25'