fairway-api/app/models/user.rb

  def calculate_verified_handicap
    return nil if rounds.verified.count < 5

    verified_rounds_data = rounds.verified
                                .includes(:hole_scores)
                                .order(started_at: :desc)
                                .limit(20)

    return nil if verified_rounds_data.count < 5

    # Get score differentials and take best 8
    differentials = verified_rounds_data.map(&:score_differential).compact.sort
    best_differentials = differentials.take([8, differentials.count].min)

    return nil if best_differentials.empty?

    # Calculate verified handicap index (average of best differentials * 0.96)
    (best_differentials.sum / best_differentials.count * 0.96).round(1)
---
SELECT "hole_scores".* FROM "hole_scores" WHERE "hole_scores"."round_id" IN ('9e2e03d7-4354-45a8-85e4-e4fbaeb64837', 'cd1e74ad-136e-430f-8be6-f39cea915407', '2ce35f3f-3c05-462c-ad23-4e2439a55a17')