fairway-api/app/controllers/application_controller.rb

  def authenticate_user!
    token = extract_token
    return unauthorized_response unless token

    begin
      payload = JwtService.decode_token(token, 'access')
      @current_user = User.find(payload['user_id'])
---
SELECT "users".* FROM "users" WHERE "users"."id" = '8d635edf-31a5-49aa-9e1d-1e596ba37a25' LIMIT 1