fairway-api/lib/tasks/courses.rake

SELECT "courses".* FROM "courses"
---
    task expand_abbreviations: :environment do
      puts "🔧 Expanding course name abbreviations..."

      # Define abbreviations to expand
      abbreviations = {
        'Gc' => 'Golf Course',
        'GC' => 'Golf Club',
        'CC' => 'Country Club',
        'Cc' => 'Country Club',
        'G&CC' => 'Golf & Country Club',
        'G&Cc' => 'Golf & Country Club',
        'G & CC' => 'Golf & Country Club',
        'G & Cc' => 'Golf & Country Club',
        'RC' => 'Resort & Club',
        'Rc' => 'Resort & Club',
        'GL' => 'Golf Links',
        'Gl' => 'Golf Links',
        'GR' => 'Golf Resort',
        'Gr' => 'Golf Resort'
      }

      fixed_count = 0

      Course.all.each do |course|

UPDATE "courses" SET "name" = 'Patterson River Country Club', "updated_at" = '2025-09-25 12:13:16.755015' WHERE "courses"."id" = 'd81998b7-8f73-449e-a589-6fd887f62f34'
---

        if new_name != original_name
          puts "Expanding: '#{original_name}' → '#{new_name}'"
          course.update!(name: new_name)

SELECT "courses".* FROM "courses" WHERE (name LIKE '% - %')
UPDATE "courses" SET "name" = 'Avalon Golf Course', "updated_at" = '2025-09-25 12:12:56.968769' WHERE "courses"."id" = '5ceb9b3c-ea93-4ba8-8668-254dfac75547'
---
    task fix_duplicate_names: :environment do
      puts "🔧 Fixing duplicate course names..."

      fixed_count = 0

      Course.where("name LIKE '% - %'").each do |course|
        parts = course.name.split(' - ')

        # Check if the parts are the same or very similar
        if parts.length == 2 && (parts[0].strip.downcase == parts[1].strip.downcase)
          new_name = parts[0].strip
          puts "Fixing: '#{course.name}' → '#{new_name}'"
          course.update!(name: new_name)

SELECT name, city, state, COUNT(*) as course_count FROM "courses" GROUP BY name, city, state HAVING (COUNT(*) > 1)
SELECT "courses".* FROM "courses" WHERE "courses"."name" = 'Avalon Golf Course' AND "courses"."city" = 'Avalon, Sydney' AND "courses"."state" = 'NSW' ORDER BY "courses"."created_at" ASC
DELETE FROM "courses" WHERE "courses"."id" = 'e7e9f18e-be11-49f2-92a2-0a2993646959'
---
    task remove_duplicates: :environment do
      puts "🧹 Starting duplicate course cleanup..."

      # Group courses by name and location to find potential duplicates
      duplicates_found = 0
      duplicates_removed = 0

      Course.select('name, city, state, COUNT(*) as course_count')
            .group('name, city, state')
            .having('COUNT(*) > 1')
            .each do |group|

        puts "Found duplicates: #{group.name} in #{group.city}, #{group.state} (#{group.course_count} courses)"
        duplicates_found += group.course_count - 1

        # Get all courses in this group
        duplicate_courses = Course.where(name: group.name, city: group.city, state: group.state)
                                 .order(:created_at) # Keep the oldest one

        # Remove all but the first (oldest) course
        courses_to_remove = duplicate_courses.drop(1)
        courses_to_remove.each do |course|
          puts "  Removing duplicate: #{course.name} (ID: #{course.id}, External ID: #{course.external_id})"
          course.destroy!