fairway-api/app/services/courses_sync_service.rb

SELECT "courses".* FROM "courses" WHERE "courses"."sync_enabled" = TRUE AND (last_synced_at IS NULL OR last_synced_at < '2025-09-18 14:05:02.139021') ORDER BY "courses"."id" ASC LIMIT 50
---
  def update_sync
    @logger.info "Starting update sync for courses needing refresh"

    courses_to_sync = Course.sync_enabled.needs_sync.limit(BATCH_SIZE)
    synced_count = 0
    error_count = 0

    courses_to_sync.find_each do |course|

SELECT COUNT(*) FROM "courses" WHERE (last_synced_at IS NULL OR last_synced_at < '2025-09-17 19:06:59.134207')
---
  def sync_stats
    {
      total_courses: Course.count,
      external_courses: Course.from_external_source('golfcourseapi').count,
      sync_enabled: Course.sync_enabled.count,
      needs_sync: Course.needs_sync.count,
      synced_recently: Course.synced_recently.count,
      never_synced: Course.where(last_synced_at: nil).count

INSERT INTO "courses" ("name", "address", "city", "state", "country", "postal_code", "latitude", "longitude", "course_rating", "slope_rating", "par", "total_yardage", "phone", "website", "description", "private_course", "active", "geofence_radius", "created_at", "updated_at", "external_id", "external_source", "last_synced_at", "sync_enabled", "external_data") VALUES ('Big Hickory Golf & Country Club - Big Hickory Golf & Country Club', '521 Old Hickory Dr, Manchester, KY 40962, USA', 'Manchester', 'KY', 'US', '40962', 37.173187, -83.74917, 68.7, 128, 72, 5901, NULL, NULL, 'Big Hickory Golf & Country Club - Big Hickory Golf & Country Club', FALSE, TRUE, 500, '2025-09-25 12:02:36.458129', '2025-09-25 12:02:36.458129', '5004', 'golfcourseapi', '2025-09-25 12:02:36.456768', TRUE, NULL) RETURNING "id"
INSERT INTO "courses" ("name", "address", "city", "state", "country", "postal_code", "latitude", "longitude", "course_rating", "slope_rating", "par", "total_yardage", "phone", "website", "description", "private_course", "active", "geofence_radius", "created_at", "updated_at", "external_id", "external_source", "last_synced_at", "sync_enabled", "external_data") VALUES ('Mock Golf Course 1', '1 Golf Lane', 'Mock City', 'MC', 'US', '12345', 40.01, -73.99, 73.0, 121, 72, 6510, '(555) 123-1001', 'https://mock-course-1.com', NULL, FALSE, TRUE, 500, '2025-09-24 18:30:32.329192', '2025-09-24 18:30:32.329192', 'mock_1', 'golfcourseapi', '2025-09-24 18:30:32.284453', TRUE, NULL) RETURNING "id"
---
  def sync_course(course_data, existing_course: nil, is_initial: false)
    # Transform API data to our schema format
    transformed_data = transform_course_data(course_data)

    if existing_course
      # Update existing course
      existing_course.update_from_external_data!(transformed_data)
      @logger.debug "Updated course: #{existing_course.name}"
      existing_course
    else
      # Check for duplicates before creating new course
      duplicate_course = find_duplicate_course(transformed_data, course_data['id'].to_s)

      if duplicate_course
        @logger.info "Duplicate course found: #{duplicate_course.name} (ID: #{duplicate_course.id}) - skipping #{transformed_data['name']}"
        return duplicate_course
      end

      # Create new course
      course = Course.new(transformed_data)
      course.external_source = 'golfcourseapi'
      course.external_id = course_data['id'].to_s
      course.sync_enabled = true
      course.last_synced_at = Time.current

      # Set defaults for required fields if not provided
      course.geofence_radius ||= 500
      course.active = true

      course.save!

SELECT "courses".* FROM "courses" WHERE "courses"."external_id" = '5000' LIMIT 1
---
  def find_duplicate_course(transformed_data, external_id)
    # Check by external_id first (most reliable)
    return Course.find_by(external_id: external_id) if external_id