fairway-api/app/services/handicap_calculator_service.rb

SELECT COUNT(*) FROM "rounds" WHERE "rounds"."user_id" = '785c65eb-f711-4691-be87-d7ed25d93556' AND "rounds"."completed_at" IS NOT NULL
---
  def get_recent_trend(rounds_count = 10)
    recent_rounds = @user.rounds.completed
                         .where.not(score_differential: nil)
                         .order(completed_at: :desc)
                         .limit(rounds_count)

    return nil if recent_rounds.count < 5