fairway-api/app/services/jwt_service.rb

UPDATE "users" SET "updated_at" = '2025-09-25 18:47:11.834539', "sign_in_count" = 1, "last_sign_in_at" = '2025-09-25 18:47:11.769638' WHERE "users"."id" = '785c65eb-f711-4691-be87-d7ed25d93556'
---
    def update_user_sign_in_info(user, ip_address, device_info)
      user.update!(
        last_sign_in_at: Time.current,
        last_sign_in_ip: ip_address,
        sign_in_count: (user.sign_in_count || 0) + 1
      )