fairway-api/app/services/round_scoring_service.rb

  def completion_percentage
    return 0 if @round.course.holes.empty?
    (@round.hole_scores.count.to_f / @round.course.holes.count * 100).round(1)
---
SELECT 1 AS one FROM "holes" WHERE "holes"."course_id" = 'a7850e90-7796-4668-9baf-f91f793901b4' LIMIT 1
SELECT COUNT(*) FROM "hole_scores" WHERE "hole_scores"."round_id" = '9e2e03d7-4354-45a8-85e4-e4fbaeb64837'
SELECT COUNT(*) FROM "holes" WHERE "holes"."course_id" = 'ae402f19-4ec4-46a4-a83f-2250fea3982f'